app/controllers/movies_controller.rb

  def search
    if params[:search].present?
      @movies = Movie.search(params[:search])
---
SELECT "movies".* FROM "movies"

  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 1]]

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "description" = ?, "movie_length" = ?, "director" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Guardians of the Galaxy"], ["description", ""], ["movie_length", "2:02"], ["director", "James Gunn"], ["rating", "PG 13"], ["updated_at", "2015-05-04 16:49:34.715023"], ["id", 3]]