app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Captain america was a cool movie"], ["user_id", 2], ["movie_id", 1], ["created_at", "2015-05-02 20:51:15.327533"], ["updated_at", "2015-05-02 20:51:15.327533"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

    if @review.save